def zdh1():
    coun = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(coun)
    print(coun["Франция"])
    for key in sorted(coun):
        print(key, "-", coun[key])
def zdh2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    word = input('Ведите слово:')
    k = 0
    for i in word:
        k += alph[i.lower()]
    print("Сумма", k)


def zdh3():
    le = ['рус', 'англ', 'китай']
    sp = {'рус': ['рахимов', 'телятникова','шамбурова','финкельберг','назаренко'],
          'англ': ['рахимов','телятникова','финкельберг','шамбурова','гумерова'],
          'китай': ['рахимов', 'гумерова','финкельберг','назаренко']}
    le.sort()
    s = len(le)
    print('Количество языков' ,s)
    print('Список по алфавиту',le)
    print('Введите любой язык из списка')
    a = str(input())
    print(sp[a])

zdh1()
zdh2()
zdh3()
